---
kind: property
id: P:Autodesk.Revit.DB.PDFExportOptions.StopOnError
source: html/97abfd1a-d0bf-b42a-5d08-784da32a062b.htm
---
# Autodesk.Revit.DB.PDFExportOptions.StopOnError Property

Whether export process should stop when a view fails to export

## Syntax (C#)
```csharp
public bool StopOnError { get; set; }
```